<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class mark_dtc_radie_2017_semester1 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // I2 student semester 1
        $id_card_from_dtc_i2_to_radie = [
            ["e20150011","VN"  ],
            ["e20150022","ឈប់រៀន"  ],
            ["e20150033","ឈប់រៀន"  ],
            ["e20150093","ប្តូរសាលា"  ],
            ["e20150098","ប្តូរសាលា"  ],
            ["e20150115","ប្តូររៀនT1"  ],
            ["e20150124","IFL"  ],
            ["e20150150","ឈប់រៀន"  ],
            ["e20150156","រៀនពេទ្យ"  ],
            ["e20150166","រៀនគ្រូ"  ],
            ["e20150181","រៀនគ្រូ"  ],
            ["e20150199","ប្តូរសាលា"  ],
            ["e20150214",""  ],
            ["e20150219","Bourse Thai"  ],
            ["e20150222","VN"  ],
            ["e20150228","VN"  ],
            ["e20150236","ឈប់រៀន"  ],
            ["e20150238","VN"  ],
            ["e20140226",""  ],
            ["e20150249",""  ],
            ["e20150293","ឈប់រៀន"  ],
            ["e20150295",""  ],
            ["e20150301","VN"  ],
            ["e20140298","ឈប់រៀន"  ],
            ["e20150324","VN"  ],
            ["e20150331",""  ],
            ["e20150340","VN"  ],
            ["e20150343",""  ],
            ["e20150353","Australia"  ],
            ["e20150360","Japon"  ],
            ["e20150370","ឈប់រៀន"  ],
            ["e20150379",""  ],
            ["e20150384",""  ],
            ["e20150386",""  ],
            ["e20150408",""  ],
            ["e20150414",""  ],
            ["e20150472",""  ],
            ["e20150479","VN"  ],
            ["e20150516","ឈប់ច្រើន"  ],
            ["e20150535","ឈប់រៀន"  ],
            ["e20150542","ឈប់រៀន"  ],
            ["e20140576","មិនដែលមករៀន"  ],
            ["e20150587","Bourse chin"  ],
            ["e20150594","VN"  ],
            ["e20150634","ឈប់រៀន"  ],
            ["e20150644","Bourse Thai"  ],
            ["e20150648","ឈប់រៀន"  ],
            ["e20150649","ឈប់រៀន"  ],
            ["e20150650","ឈប់រៀន"  ],
            ["e20150663","មិនដែលមករៀន"  ],
            ["e20150703","VN"  ],
            ["e20150707","Bourse Thai"  ],
            ["e20150709","ប្តូរសាលា"  ],
            ["e20150720","មិនដែលមករៀន"  ],
            ["e20150721",""  ],
            ["e20150725","ឈប់រៀន"  ],
            ["e20140724","Bourse chin"  ],
            ["e20150737","Lao"  ],
            ["e20150741","VN"  ],
            ["e20150754","Bourse chin"  ],
            ["e20150781","ប្តូរសាលា"  ],
            ["e20150783","Bourse Thai"  ],
            ["e20140769","មិនដែលមករៀន"  ],
            ["e20150794","ឈប់រៀន"  ],
            ["e20150811","Bourse chin"  ],
            ["e20150828","Bourse Thai"  ],
            ["e20150834","ប្តូរសាលា"  ],
            ["e20140825","ឈប់ច្រើន"  ],
            ["e20150835","ឈប់ច្រើន"  ],
            ["e20150838","Bourse"  ]
        ];
        $id_card_from_dtc_i2_to_redouble = [
            ["e20150165","Suspendu"  ],
            ["e20150383","Suspendu"  ],
            ["e20150447","Suspendu"  ],
            ["e20150481","Suspendu"  ],
            ["e20150485","Suspendu"  ],
            ["e20150533","Suspendu"  ],
            ["e20150611","Suspendu"  ],
            ["e20150617","Suspendu"  ],
            ["e20150819","Suspendu"  ],
            ["e20150790","Suspendu"  ],
            ["e20150579","Suspendu"  ],
            ["e20150358","Suspendu"  ]
        ];

        // I1 student semsester 1
        $id_card_from_dtc_i1_to_radie = [
            ["e20160011","មិនដែលមករៀន"  ],
            ["e20160013","រៀនពេទ្យ"  ],
            ["e20160039","គ្រូបឋម"  ],
            ["e20160041","មិនដែលមករៀន"  ],
            ["e20160049","គ្រូបឋម"  ],
            ["e20160057","Bourse Thai"  ],
            ["e20160058","មិ​​​នដែលមករៀន"  ],
            ["e20160062","ឈប់រៀន"  ],
            ["e20160063","ឈប់រៀន"  ],
            ["e20160064","រៀនពេទ្យ"  ],
            ["e20160067","Bourse Thai"  ],
            ["e20160070","ឈប់រៀន"  ],
            ["e20161210","ឈប់រៀន"  ],
            ["e20160084",""  ],
            ["e20160085","គ្រូបឋម"  ],
            ["e20160087","ឈប់រៀន"  ],
            ["e20160095","ឈប់រៀន"  ],
            ["e20160123","រៀនពេទ្យ"  ],
            ["e20160124","គ្រូបឋម"  ],
            ["e20160125","Bourse Thai"  ],
            ["e20160151","Bourse "  ],
            ["e20160153","ប្តូរសាលា"  ],
            ["e20160171","Bourse"  ],
            ["e20160174","ឈប់រៀន"  ],
            ["e20160176",""  ],
            ["e20160187","ឈប់រៀន"  ],
            ["e20160190","ឈប់រៀន"  ],
            ["e20160197","ឈប់រៀន"  ],
            ["e20160201","ឈប់រៀន"  ],
            ["e20160215","រៀនពេទ្យ"  ],
            ["e20160228","ឈប់រៀន"  ],
            ["e20160262","ឈប់រៀន"  ],
            ["e20160272","ឈប់រៀន"  ],
            ["e20160273","រៀនពេទ្យ"  ],
            ["e20150307","ឈប់រៀន"  ],
            ["e20160636","ប្តូរសាលា"  ],
            ["e20160285","រៀនពេទ្យ"  ],
            ["e20161218","មិនដែលមករៀន"  ],
            ["e20160296","មិនដែលមករៀន"  ],
            ["e20160302","ប្តូរសាលា"  ],
            ["e20160316","ឈប់ច្រើន"  ],
            ["e20160317","ឈប់រៀន"  ],
            ["e20160328","ឈប់ច្រើន"  ],
            ["e20160332","ប្តូរសាលា"  ],
            ["e20160336",""  ],
            ["e20160360",""  ],
            ["e20160365",""  ],
            ["e20160370",""  ],
            ["e20160375","ឈប់ច្រើន"  ],
            ["e20150398","ឈប់ច្រើន"  ],
            ["e20160382","ឈប់ច្រើន"  ],
            ["e20160397","ឈប់ច្រើន"  ],
            ["e20160401","ឈប់ច្រើន"  ],
            ["e20160415","ឈប់ច្រើន"  ],
            ["e20160433","ឈប់ច្រើន"  ],
            ["e20160447","ឈប់ច្រើន"  ],
            ["e20160448","ឈប់រៀន"  ],
            ["e20160465","រៀនពេទ្យ"  ],
            ["e20160471","រៀនពេទ្យ"  ],
            ["e20160495","ឈប់រៀន"  ],
            ["e20160501","ឈប់រៀន"  ],
            ["e20160506","ឈប់រៀន"  ],
            ["e20160542",""  ],
            ["e20160546",""  ],
            ["e20160597",""  ],
            ["e20160604","មិនដែលមករៀន"  ],
            ["e20160628","មិនដែលមករៀន"  ],
            ["e20160632","ឈប់ច្រើន"  ],
            ["e20160651","ឈប់ច្រើន"  ],
            ["e20160658","ឈប់ច្រើន"  ],
            ["e20160660","រៀនពេទ្យ"  ],
            ["e20160683","IFL"  ],
            ["e20160698","រៀនពេទ្យ"  ],
            ["e20160715","ឈប់ច្រើន"  ],
            ["e20150715","ឈប់ច្រើន"  ],
            ["e20150718","ឈប់ច្រើន"  ],
            ["e20160719","ឈប់ច្រើន"  ],
            ["e20160723","ឈប់ច្រើន"  ],
            ["e20160725",""  ],
            ["e20160746","ឈប់ច្រើន"  ],
            ["e20160747","រៀនពេទ្យ"  ],
            ["e20160749","ឈប់រៀន"  ],
            ["e20160760",""  ],
            ["e20150765","ឈប់ច្រើន"  ],
            ["e20160763",""  ],
            ["e20160766","រៀនពេទ្យ"  ],
            ["e20160785","ឈប់ច្រើន"  ],
            ["e20160786","ឈប់ច្រើន"  ],
            ["e20160794","រៀនពេទ្យ"  ],
            ["e20160795","ឈប់ច្រើន"  ],
            ["e20160810","ឈប់ច្រើន"  ],
            ["e20150814","ឈប់ច្រើន"  ],
            ["e20160834","រៀនពេទ្យ"  ],
            ["e20160838",""  ],
            ["e20160845",""  ]
        ];
        $id_card_from_dtc_i1_to_redouble = [
            ["e20160142","Suspendu"],
            ["e20160298","Suspendu"],
            ["e20160564","Suspendu"]
        ];

        foreach($id_card_from_dtc_i2_to_radie as $arr){
            $student = \App\Models\Student::where('id_card',$arr[0])->first();

            if($student){
                $student->radie = true;
                $student->save();

                \App\Models\StudentAnnual::where("student_id",$student->id)
                    ->where('degree_id',1)
                    ->where('grade_id',2)
                    ->where('academic_year_id',2017)
                    ->where('department_id',8)->update(['general_remark'=>$arr[1]]);

            } else {
                dump($arr[0]);
            }

        }
        foreach($id_card_from_dtc_i1_to_radie as $arr){
            $student = \App\Models\Student::where('id_card',$arr[0])->first();
            if($student) {
                $student->radie = true;
                $student->save();

                \App\Models\StudentAnnual::where("student_id",$student->id)
                    ->where('degree_id',1)
                    ->where('grade_id',1)
                    ->where('academic_year_id',2017)
                    ->where('department_id',8)->update(['general_remark'=>$arr[1]]);
            } else {
                dump($arr[0]);
            }


        }
        foreach($id_card_from_dtc_i2_to_redouble as $arr){
            $student = \App\Models\Student::where('id_card',$arr[0])->first();
            if($student) {
                DB::table('redouble_student')->insert(
                    ['redouble_id'=>2,'student_id'=>$student->id,'academic_year_id'=>2017,'is_changed'=>true]
                );

                \App\Models\StudentAnnual::where("student_id",$student->id)
                    ->where('degree_id',1)
                    ->where('grade_id',2)
                    ->where('academic_year_id',2017)
                    ->where('department_id',8)->update(['general_remark'=>$arr[1]]);
            } else {
                dump($arr[0]);
            }

        }

        foreach($id_card_from_dtc_i1_to_redouble as $id){
            $student = \App\Models\Student::where('id_card',$arr[0])->first();
            if($student) {
                DB::table('redouble_student')->insert(
                    ['redouble_id'=>1,'student_id'=>$student->id,'academic_year_id'=>2017,'is_changed'=>true]
                );

                \App\Models\StudentAnnual::where("student_id",$student->id)
                    ->where('degree_id',1)
                    ->where('grade_id',1)
                    ->where('academic_year_id',2017)
                    ->where('department_id',8)->update(['general_remark'=>$arr[1]]);
            } else {
                dump($arr[0]);
            }

        }

    }
}
