<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Labels Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in labels throughout the system.
    | Regardless where it is placed, a label can be listed here so it is easily
    | found in a intuitive way.
    |
    */


                    '1' => '០១',
                    '2' => '០២',
                    '3' => '០៣',
                    '4' => '០៤',
                    '5' => '០៥',
                    '6' => '០៦',
                    '7' => '០៧',
                    '8' => '០៨',
                    '9' => '០៩',
                    '10' => '១០',
                    '11' => '១១',
                    '12' => '១២',
                    '13' => '១៣',
                    '14' => '១៤',
                    '15' => '១៥',
                    '16' => '១៦',
                    '17' => '១៧',
                    '18' => '១៨',
                    '19' => '១៩',
                    '20' => '២០',
                    '21' => '២១',
                    '22' => '២២',
                    '23' => '២៣',
                    '24' => '២៤',
                    '25' => '២៥',
                    '26' => '២៦',
                    '27' => '២៧',
                    '28' => '២៨',
                    '29' => '២៩',
                    '30' => '៣០',
                    '31' => '៣១',

                    'Monday' => 'ចន្ទ័',
                    'Tuesday' => 'អង្គារ',
                    'Wednesday' => 'ពុធ',
                    'Thursday' => 'ព្រហស៏',
                    'Friday' => 'សុក្រ',
                    'Saturday' => 'សៅរ៏',
                    'Sunday' => 'អាទិត្យ',

                    'January' => 'មករា',
                    'Febrary' => 'កុម្ភះ',
                    'March' => 'មិនា',
                    'April' => 'មេសា',
                    'May' => 'ឧសភា',
                    'June' => 'មិថុនា',
                    'July' => 'កក្កដា',
                    'Agust' => 'សីហា',
                    'September' => 'កញ្ញា',
                    'October' => 'តុលា',
                    'November' => 'វិច្ឆការ',
                    'December' => 'ធ្នូ'

];
